vars = [
    "Извините, я не могу отвечать на вопросы не по теме финансов, отчетности и аналитики.",
    "К сожалению, по вашему вопросу ничего не найдено, попробуйте задать вопрос по другому.",
    "Не найдена информация по вашему запросу, попробуйте переформулировать вопрос или сменить тему.",
    "Извините, я могу помочь только с вопросами, связанными с финансами и аналитикой.",
    "К сожалению, я не располагаю информацией по вашему запросу. Пожалуйста, уточните вопрос.",
    "Извините, я не могу помочь с вопросами, выходящими за пределы финансов и отчетности.",
    "К сожалению, ваш вопрос не относится к моей области знаний. Пожалуйста, задайте вопрос по финансам, аналитике или отчётности.",
    "Походящая информация не может быть найдена, попробуйте переформулировать вопрос.",
    "Релевантная информация не найдена, попробуйте переформулировать вопрос или изменить тему запроса.",
]
