
CODE_NAME = {
    1110: "Нематериальные активы",
    1111: "Неисключительные права на использование программного обеспечения и прочих активов",
    1120: "Результаты исследований и разработок",
    1130: "Нематериальные поисковые активы",
    1140: "Материальные поисковые активы",
    1150: "Основные средства",
    1151: "Незавершенные капитальные вложения",
    1160: "Доходные вложения в материальные ценности",
    1170: "Финансовые вложения",
    1180: "Отложенные налоговые активы",
    1190: "Прочие внеоборотные активы",
    1100: "ИТОГО по разделу I",
    1210: "Запасы",
    1220: "Налог на добавленную стоимость по приобретенным ценностям",
    1230: "Дебиторская задолженность",
    1240: "Финансовые вложения (за исключением денежных эквивалентов)",
    1250: "Денежные средства и денежные эквиваленты",
    1260: "Прочие оборотные активы",
    1200: "ИТОГО по разделу II",
    1600: "БАЛАНС (актив)",
    1310: "Уставный капитал (складочный капитал, уставный фонд, вклады товарищей)",
    1320: "Собственные акции, выкупленные у акционеров",
    1340: "Переоценка внеоборотных активов",
    1350: "Добавочный капитал (без переоценки)",
    1360: "Резервный капитал",
    1370: "Нераспределенная прибыль (непокрытый убыток)",
    1300: "ИТОГО по разделу III",
    1410: "Заемные средства",
    1420: "Отложенные налоговые обязательства",
    1430: "Оценочные обязательства",
    1431: "Кредиторская задолжность",
    1432: "Доходы будущих периодов",
    1450: "Прочие обязательства",
    1400: "ИТОГО по разделу IV",
    1510: "Заемные средства",
    1520: "Кредиторская задолженность",
    1530: "Доходы будущих периодов",
    1540: "Оценочные обязательства",
    1550: "Прочие обязательства",
    1500: "ИТОГО по разделу V",
    1700: "БАЛАНС (пассив)",
    2110: "Выручка",
    2120: "Себестоимость продаж",
    2100: "Валовая прибыль (убыток)",
    2210: "Коммерческие расходы",
    2220: "Управленческие расходы",
    2200: "Прибыль (убыток) от продаж",
    2310: "Доходы от участия в других организациях",
    2320: "Проценты к получению",
    2330: "Проценты к уплате",
    2340: "Прочие доходы",
    2350: "Прочие расходы",
    2300: "Прибыль (убыток) до налогообложения",
    2410: "Текущий налог на прибыль",
    2421: "в т.ч. постоянные налоговые обязательства (активы)",
    2430: "Изменение отложенных налоговых обязательств",
    2450: "Изменение отложенных налоговых активов",
    2451: "Налог на прибыль и налоговые санкции прошлых лет",
    2460: "Прочее",
    2400: "Чистая прибыль (убыток)",
    2510: "Результат от переоценки внеоборотных активов, не включаемый в чистую прибыль (убыток) периода",
    2520: "Результат от прочих операций, не включаемый в чистую прибыль (убыток) периода",
    2500: "Совокупный финансовый результат периода",
    2900: "Базовая прибыль (убыток) на акцию",
    2910: "Разводненная прибыль (убыток) на акцию"
}

MULTYPLIER_NAME = {
    "ROE": "Рентабельность собственного капитала",
    "CR": "Текущая ликвидность",  # Current Ratio
    "QR": "Быстрая ликвидность",  # Quick Ratio
    "AR": "Абсолютная ликвидность",  # Absolute Ratio
    "GP_Margin": "Рентабельность продаж по валовой прибыли",  # Gross Profit Margin
    "OP_Margin": "Рентабельность продаж по операционной прибыли",  # Operating Profit Margin
    "NP_Margin": "Рентабельность продаж по чистой прибыли",  # Net Profit Margin
    "ROA": "Рентабельность всех активов",  # Return on Assets
    "ROCA": "Рентабельность оборотных активов",  # Return on Current Assets
    "RONCA": "Рентабельность внеоборотных активов",  # Return on Non-Current Assets
    "Autonomy_Ratio": "Коэффициент автономии",  # Autonomy Ratio
    "Capitalization_Ratio": "Коэффициент капитализации",  # Capitalization Ratio
    "Investment_Coverage_Ratio": "Коэффициент покрытия инвестиций",  # Investment Coverage Ratio
    "Inventory_Security_Ratio": "Коэффициент обеспеченности материальных запасов",  # Inventory Security Ratio
    "Financial_Dependency_Ratio": "Коэффициент финансовой зависимости",  # Financial Dependency Ratio
    "Financial_Leverage_Ratio": "Коэффициент финансового левериджа"  # Financial Leverage Ratio
}

